# Leçon SQL 7: JOINTS EXTERNES

Selon la façon dont vous souhaitez analyser les données, la jointure interne que nous avons utilisée lors de la dernière leçon peut ne pas être suffisante car la table résultante ne contient que des données appartenant aux deux tables.

Si les deux tables contiennent des données asymétriques, ce qui peut facilement se produire lorsque les données sont saisies à différentes étapes, nous devrions alors utiliser un **LEFT JOIN**, **RIGHT JOIN** ou à la place **FULL JOIN**, nous assurer que les données dont vous avez besoin ne sont pas exclues des résultats.

Sélectionnez la requête avec des jointures GAUCHE / DROITE / FULL sur plusieurs tables
``` mysql 
SELECT column, another_column, …
FROM mytable
INNER/LEFT/RIGHT/FULL JOIN another_table 
    ON mytable.id = another_table.matching_id
WHERE condition(s)
ORDER BY column, … ASC/DESC
LIMIT num_limit OFFSET num_offset;
```

Comme **INNER JOIN**, ces trois nouvelles jointures doivent spécifier la colonne sur laquelle joindre les données.

 Lors de la jonction de la table A à la table B, une jointure à gauche **LEFT JOIN** inclut simplement des lignes de A indépendamment du fait qu'une ligne correspondante soit trouvée dans B.
 
 La jointure à droite **RIGHT JOIN** est la même, mais inversée, gardant les lignes dans B indépendamment du fait qu'une correspondance soit trouvée dans A 
 
 Enfin, un **FULL JOIN** signifie simplement que les lignes des deux tables sont conservées, qu'il existe ou non une ligne correspondante dans l'autre table.

Lorsque vous utilisez l'une de ces nouvelles jointures, vous devrez probablement écrire une logique supplémentaire pour traiter les valeurs **NULL** dans le résultat et les contraintes (plus d'informations à ce sujet dans la leçon suivante).

**Le saviez-vous?**
Vous pouvez voir les requêtes avec ces jointures écrites comme LEFT OUTER JOIN, RIGHT OUTER JOINou FULL OUTER JOIN, mais le OUTER mot - clé est vraiment conservé pour la compatibilité SQL-92 et ces requêtes sont tout simplement équivalent à LEFT JOIN, RIGHT JOINet FULL JOINrespectivement.

## Exercice

Dans cet exercice, vous allez travailler avec une nouvelle table qui stocke des données fictives sur les **employes** dans le studio de cinéma et leur bureau attribué **batiments**. 

Certains bâtiments sont neufs, ils n'ont donc pas encore d'employés, mais nous devons malgré tout trouver des informations à leur sujet.

La base de données SQL de notre navigateur étant quelque peu limitée, seule la jointure à gauche est prise en charge dans l'exercice ci-dessous.

In [1]:
import pandas as pd

def to_df(s):
    l= [elt.split(';') for elt in s.replace("	", ";").split('\n')]
    return pd.DataFrame(l[1:], columns=l[0])

In [2]:
from pandasql import sqldf

In [3]:
x="""Building_name	Capacity
1e	24
1w	32
2e	16
2w	20"""

In [4]:
batiments=to_df(x)# buildings

In [5]:
batiments

  Building_name Capacity
0            1e       24
1            1w       32
2            2e       16
3            2w       20

In [6]:
y="""Role	Name	Building	Years_employed
Engineer	Becky A.	1e	4
Engineer	Dan B.	1e	2
Engineer	Sharon F.	1e	6
Engineer	Dan M.	1e	4
Engineer	Malcom S.	1e	1
Artist	Tylar S.	2w	2
Artist	Sherman D.	2w	8
Artist	Jakob J.	2w	6
Artist	Lillia A.	2w	7
Artist	Brandon J.	2w	7
Manager	Scott K.	1e	9
Manager	Shirlee M.	1e	3
Manager	Daria O.	2w	6"""

In [7]:
employes=to_df(y) #employees

In [8]:
employes

        Role        Name Building Years_employed
0   Engineer    Becky A.       1e              4
1   Engineer      Dan B.       1e              2
2   Engineer   Sharon F.       1e              6
3   Engineer      Dan M.       1e              4
4   Engineer   Malcom S.       1e              1
5     Artist    Tylar S.       2w              2
6     Artist  Sherman D.       2w              8
7     Artist    Jakob J.       2w              6
8     Artist   Lillia A.       2w              7
9     Artist  Brandon J.       2w              7
10   Manager    Scott K.       1e              9
11   Manager  Shirlee M.       1e              3
12   Manager    Daria O.       2w              6

1. Trouvez la liste de tous les bâtiments qui ont des employés

In [41]:
QUERY1 = "SELECT DISTINCT b.Building_name FROM employes e LEFT JOIN batiments b ON e.Building = b.Building_name"

In [42]:
sqldf(QUERY1)

  Building_name
0            1e
1            2w

2. Retrouvez la liste de tous les bâtiments et leur capacité

In [23]:
QUERY2 = "SELECT * FROM batiments"

In [24]:
sqldf(QUERY2)

  Building_name Capacity
0            1e       24
1            1w       32
2            2e       16
3            2w       20

3. Répertoriez tous les bâtiments et les rôles distincts des employés dans chaque bâtiment (y compris les bâtiments vides)

In [31]:
QUERY3 = "SELECT DISTINCT Building_name, Role FROM batiments b LEFT JOIN employes e ON e.Building = b.Building_name"

In [32]:
sqldf(QUERY3)

  Building_name      Role
0            1e  Engineer
1            1e   Manager
2            1w      None
3            2e      None
4            2w    Artist
5            2w   Manager